/*
 * Операторы сравнения
a > b і a < b - більше/менше
a >= b і a <= b - більше/менше або дорівнює
a == b - рівність
a != b - нерівність
a === b - строга рівність
a !== b - строга нерівність
 */

// console.log(15 > 3);

/*
 * Приведение (преобразование) типов к числу
 */

// console.log('10' > 5);
/* операторы сравнения приводят операнды (сравниваемые значения к числу)
* '10' - строка 10 будет приведена(преобразована в) к числу 10)
 */
/*
 * Операторы равенства (== и ===) и неравества (!= и !==)
 * ✅ «ВСЕГДА ИСПОЛЬЗУЕМ СТРОГОЕ РАВЕНСТВО (===) и НЕРАВЕНСТВО (!==)»
 */
// одинарный знак равно "=" - это оператор присвоения
// если хотим сравнить
//в табличке в конспекте, указаны результаты сравнения, если используются операторы Не строгого равенства и неравенства,
//так как все приводится к строке
//чтобы все-таки сравнить два значения нужно использовать операторы СТРОГОГО равенства и неравенства === и !==,
//в таком случае не происходит приведение типов

// const isEqual = 1 === true;

// console.log(isEqual);
